IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_dcsm_common_regs.xml
<module id="DCSM_COMMON_REGS" HW_revision="" description="DCSM COMMON Registers">
	<register id="FLSEM" width="32" page="1" offset="0x0" internal="0" description="Flash Wrapper Semaphore Register">
		<bitfield id="SEM" description="Flash Semaphore Bit" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="Semaphore Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="B0_SECTSTAT" width="32" page="1" offset="0x2" internal="0" description="Flash BANK0 Sectors Status Register">
		<bitfield id="STATUS_SECT0" description="Zone Status Flash BANK0 Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT1" description="Zone Status Flash BANK0 sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT2" description="Zone Status Flash BANK0 Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT3" description="Zone Status Flash BANK0 Sector 3 " begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT4" description="Zone Status Flash BANK0 Sector 4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT5" description="Zone Status Flash BANK0 Sector 5 " begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT6" description="Zone Status Flash BANK0 Sector 6 " begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT7" description="Zone Status Flash BANK0 Sector 7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT8" description="Zone Status Flash BANK0 sector 8" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT9" description="Zone Status Flash BANK0 Sector 9" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT10" description="Zone Status Flash BANK0 Sector 10" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT11" description="Zone Status Flash BANK0 Sector 11" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT12" description="Zone Status Flash BANK0 Sector 12" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT13" description="Zone Status Flash BANK0 Sector 13" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT14" description="Zone Status Flash BANK0 Sector 14" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT15" description="Zone Status Flash BANK0 Sector 15" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="RAMSTAT" width="32" page="1" offset="0x4" internal="0" description="RAM Status Register">
		<bitfield id="STATUS_RAM4" description="Zone Status RAM LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM5" description="Zone Status RAM LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM6" description="Zone Status RAM LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM7" description="Zone Status RAM LS7" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="SECERRSTAT" width="32" page="1" offset="0xa" internal="0" description="Security Error Status Register">
		<bitfield id="ERR" description="Security Configuration load Error Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="SECERRCLR" width="32" page="1" offset="0xc" internal="0" description="Security Error Clear Register">
		<bitfield id="ERR" description="Clear Security Configuration Load Error Status Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SECERRFRC" width="32" page="1" offset="0xe" internal="0" description="Security Error Force Register">
		<bitfield id="ERR" description="Set Security Configuration Load Error Status Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
